package kezikov.vkprocessor.service;

import org.springframework.stereotype.Component;

@Component
public class Declarations {
    private static String[] sport = {
            "мотоспорт",
            "Авиамодельный",
            "гребля",
            "Акробатика",
            "Бадминтон",
            "Баскетбол",
            "Биатлон",
            "Бильярд",
            "Бейсбол",
            "Бокс",
            "Бобслей",
            "Бодибилдинг",
            "Боулинг",
            "Велоспорт",
            "велосипед",
            "поло",
            "Волейбол",
            "борьба",
            "Гандбол",
            "Гольф",
            "Дзюдо",
            "Единоборства",
            "Киберспорт",
            "Коньки",
            "Покер",
            "батут",
            "Теннис",
            "Тяжелая атлетика",
            "Фехтование",
            "Фигурное катание",
            "Футбол",
            "Хоккей",
            "гимнастика",
            "Шахматы",
            "Экстрим"};


    public static String[] getSportArray() {
        return sport;
    }
}
